Autodesk.Revit.DB.ExportLinetypeKey.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ExportLinetypeKey.OriginalLinetypeName
The original linetype name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.ExportLinetypeKey.#ctor(System.String)
Constructs a new default ExportLinetypeKey using the original line type name as input.
originalLinetypeName:
The original line type name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.ExportLinetypeKey.#ctor
Constructs a new default ExportLinetypeKey.
Since:
2014

Autodesk.Revit.DB.ExportLinetypeKey.#ctor(Autodesk.Revit.DB.ExportLinetypeKey)
Constructs a new copy of the input ExportLinetypeKey object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.ExportLinetypeKey
A key used to represent an item stored in an Autodesk.Revit.DB.ExportLinetypeTable.
Since:
2014